In [46]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [79]:
'''Task 1:
Read the following data set: https://archive.ics.uci.edu/ml/machine-learning-databases/adult/'''

df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data', header=None)
df.head(5)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [80]:
'''Rename the columns as per the description from this file:
https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.names'''

df.columns =['age','workclass','fnlwgt','education','education_num','marital_status','occupation','relationship','race','sex','capital_gain',
            'capital_loss','hours_per_week','native_country','income']

df.head(5)

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [81]:
'''Task:
Create a sql db from adult dataset and name it sqladb'''

import sqlite3
connection = sqlite3.connect(':memory:')
cursor = connection.cursor()
df.to_sql('sqladb',connection)

In [82]:
'''sql db from adult dataset and name it sqladb
1. Select 10 records from the adult sqladb'''

print(pd.read_sql_query('SELECT * FROM sqladb limit 10', connection))

   index  age          workclass  fnlwgt   education  education_num  \
0      0   39          State-gov   77516   Bachelors             13
1      1   50   Self-emp-not-inc   83311   Bachelors             13
2      2   38            Private  215646     HS-grad              9
3      3   53            Private  234721        11th              7
4      4   28            Private  338409   Bachelors             13
5      5   37            Private  284582     Masters             14
6      6   49            Private  160187         9th              5
7      7   52   Self-emp-not-inc  209642     HS-grad              9
8      8   31            Private   45781     Masters             14
9      9   42            Private  159449   Bachelors             13

           marital_status          occupation    relationship    race  \
0           Never-married        Adm-clerical   Not-in-family   White
1      Married-civ-spouse     Exec-managerial         Husband   White
2                Divorced   Handlers-cleaners   Not-in-family   White
3      Married-civ-spouse   Handlers-cleaners         Husband   Black
4      Married-civ-spouse      Prof-specialty            Wife   Black
5      Married-civ-spouse     Exec-managerial            Wife   White
6   Married-spouse-absent       Other-service   Not-in-family   Black
7      Married-civ-spouse     Exec-managerial         Husband   White
8           Never-married      Prof-specialty   Not-in-family   White
9      Married-civ-spouse     Exec-managerial         Husband   White

       sex  capital_gain  capital_loss  hours_per_week  native_country  income
0     Male          2174             0              40   United-States   <=50K
1     Male             0             0              13   United-States   <=50K
2     Male             0             0              40   United-States   <=50K
3     Male             0             0              40   United-States   <=50K
4   Female             0             0              40            Cuba   <=50K
5   Female             0             0              40   United-States   <=50K
6   Female             0             0              16         Jamaica   <=50K
7     Male             0             0              45   United-States    >50K
8   Female         14084             0              50   United-States    >50K
9     Male          5178             0              40   United-States    >50K

In [66]:
'''2. Show me the average hours per week of all men who are working in private sector'''

cursor.execute('SELECT avg(hours_per_week) as average FROM sqladb WHERE sex= " Male" AND workclass=" Private"').fetchall()

[(42.22122591006424,)]

In [68]:
'''3.Show me the frequency table for education, occupation and relationship, separately'''

#frequency table for education
print(pd.read_sql_query('SELECT education, count(education) FROM sqladb GROUP BY education',connection))

        education  count(education)
0            10th               933
1            11th              1175
2            12th               433
3         1st-4th               168
4         5th-6th               333
5         7th-8th               646
6             9th               514
7      Assoc-acdm              1067
8       Assoc-voc              1382
9       Bachelors              5355
10      Doctorate               413
11        HS-grad             10501
12        Masters              1723
13      Preschool                51
14    Prof-school               576
15   Some-college              7291

In [69]:
#frequency table for occupation
print(pd.read_sql_query('SELECT occupation, count(occupation) FROM sqladb GROUP BY occupation',connection))

            occupation  count(occupation)
0                    ?               1843
1         Adm-clerical               3770
2         Armed-Forces                  9
3         Craft-repair               4099
4      Exec-managerial               4066
5      Farming-fishing                994
6    Handlers-cleaners               1370
7    Machine-op-inspct               2002
8        Other-service               3295
9      Priv-house-serv                149
10      Prof-specialty               4140
11     Protective-serv                649
12               Sales               3650
13        Tech-support                928
14    Transport-moving               1597

In [70]:
#relationship frequency table
print(pd.read_sql_query('SELECT relationship, count(*) FROM sqladb GROUP BY relationship',connection))

      relationship  count(*)
0          Husband     13193
1    Not-in-family      8305
2   Other-relative       981
3        Own-child      5068
4        Unmarried      3446
5             Wife      1568

In [72]:
'''4. Are there any people who are married, working in private sector and having a masters
degree'''

print(pd.read_sql_query('''SELECT * FROM sqladb WHERE education=" Masters" AND workclass=" Private" AND marital_status IN (' Married-civ-spouse', ' Married-spouse-absent' , ' Married-AF-spouse')''',
                       connection).head(5))

   index  age workclass  fnlwgt education  education_num       marital_status  \
0      5   37   Private  284582   Masters             14   Married-civ-spouse
1     87   33   Private  202051   Masters             14   Married-civ-spouse
2    100   76   Private  124191   Masters             14   Married-civ-spouse
3    188   31   Private   99928   Masters             14   Married-civ-spouse
4    198   35   Private  138992   Masters             14   Married-civ-spouse

         occupation     relationship    race      sex  capital_gain  \
0   Exec-managerial             Wife   White   Female             0
1    Prof-specialty          Husband   White     Male             0
2   Exec-managerial          Husband   White     Male             0
3    Prof-specialty             Wife   White   Female             0
4    Prof-specialty   Other-relative   White     Male          7298

   capital_loss  hours_per_week  native_country  income Net_Capital_Gain
0             0              40   United-States   <=50K                0
1             0              50   United-States   <=50K                0
2             0              40   United-States    >50K                0
3             0              50   United-States   <=50K                0
4             0              40   United-States    >50K             7298

In [73]:
'''5. What is the average, minimum and maximum age group for people working in different
sectors'''

cursor.execute('SELECT workclass, avg(age) as average, min(age), max(age) from sqladb group by workclass').fetchall()

[(' ?', 40.960239651416124, 17, 90),
 (' Federal-gov', 42.590625, 17, 90),
 (' Local-gov', 41.75107501194458, 17, 90),
 (' Never-worked', 20.571428571428573, 17, 30),
 (' Private', 36.797585477617204, 17, 90),
 (' Self-emp-inc', 46.01702508960574, 17, 84),
 (' Self-emp-not-inc', 44.96969696969697, 17, 90),
 (' State-gov', 39.43605546995377, 17, 81),
 (' Without-pay', 47.785714285714285, 19, 72)]

In [57]:
'''6. Calculate age distribution by country'''

#distribution by minimum age, maximum age and average age of countries
cursor.execute('SELECT native_country, min(age), max(age), avg(age) from sqladb group by native_country').fetchall()

[(' ?', 17, 90, 38.72555746140652),
 (' Cambodia', 18, 65, 37.78947368421053),
 (' Canada', 17, 80, 42.54545454545455),
 (' China', 22, 75, 42.53333333333333),
 (' Columbia', 18, 75, 39.71186440677966),
 (' Cuba', 21, 82, 45.76842105263158),
 (' Dominican-Republic', 18, 78, 37.72857142857143),
 (' Ecuador', 21, 90, 36.642857142857146),
 (' El-Salvador', 17, 79, 34.132075471698116),
 (' England', 17, 90, 41.15555555555556),
 (' France', 20, 64, 38.96551724137931),
 (' Germany', 18, 74, 39.25547445255474),
 (' Greece', 22, 65, 46.206896551724135),
 (' Guatemala', 19, 66, 32.421875),
 (' Haiti', 17, 63, 38.27272727272727),
 (' Holand-Netherlands', 32, 32, 32.0),
 (' Honduras', 18, 58, 33.84615384615385),
 (' Hong', 19, 60, 33.65),
 (' Hungary', 24, 81, 49.38461538461539),
 (' India', 17, 61, 38.09),
 (' Iran', 22, 63, 39.41860465116279),
 (' Ireland', 23, 68, 36.458333333333336),
 (' Italy', 19, 77, 46.42465753424658),
 (' Jamaica', 18, 66, 35.592592592592595),
 (' Japan', 19, 61, 38.24193548387097),
 (' Laos', 19, 56, 34.72222222222222),
 (' Mexico', 17, 81, 33.29082426127527),
 (' Nicaragua', 19, 67, 33.61764705882353),
 (' Outlying-US(Guam-USVI-etc)', 21, 63, 38.714285714285715),
 (' Peru', 17, 69, 35.25806451612903),
 (' Philippines', 17, 90, 39.44444444444444),
 (' Poland', 17, 85, 43.11666666666667),
 (' Portugal', 19, 78, 40.2972972972973),
 (' Puerto-Rico', 17, 90, 40.50877192982456),
 (' Scotland', 18, 62, 40.416666666666664),
 (' South', 19, 90, 38.75),
 (' Taiwan', 20, 61, 33.8235294117647),
 (' Thailand', 19, 55, 34.94444444444444),
 (' Trinadad&Tobago', 17, 61, 41.31578947368421),
 (' United-States', 17, 90, 38.65567363729859),
 (' Vietnam', 19, 73, 34.059701492537314),
 (' Yugoslavia', 20, 66, 38.8125)]

In [83]:
'''7. Compute a new column as 'Net-Capital-Gain' from the two columns 'capital-gain' and
'capital-loss'''

cursor.execute('ALTER TABLE sqladb ADD COLUMN Net_Capital_Gain varchar(20)')
cursor.execute('UPDATE sqladb SET Net_Capital_Gain = capital_gain - capital_loss')

In [84]:
print(pd.read_sql_query('SELECT Net_Capital_Gain FROM sqladb',
                        connection).head(5))

  Net_Capital_Gain
0             2174
1                0
2                0
3                0
4                0

In [85]:
'''Task 2:
1. Create an sqlalchemy engine using a sample from the data set'''

import sqlalchemy
import sqlite3
from sqlalchemy import create_engine
engine = create_engine('sqlite:///sqladb', echo=False)
df.to_sql('sqladb', engine, if_exists='replace')

connection  = sqlite3.connect("sqladb")
cursor = connection.cursor()

In [86]:
print(pd.read_sql_query("SELECT * FROM sqladb", connection).head(5))

   index  age          workclass  fnlwgt   education  education_num  \
0      0   39          State-gov   77516   Bachelors             13
1      1   50   Self-emp-not-inc   83311   Bachelors             13
2      2   38            Private  215646     HS-grad              9
3      3   53            Private  234721        11th              7
4      4   28            Private  338409   Bachelors             13

        marital_status          occupation    relationship    race      sex  \
0        Never-married        Adm-clerical   Not-in-family   White     Male
1   Married-civ-spouse     Exec-managerial         Husband   White     Male
2             Divorced   Handlers-cleaners   Not-in-family   White     Male
3   Married-civ-spouse   Handlers-cleaners         Husband   Black     Male
4   Married-civ-spouse      Prof-specialty            Wife   Black   Female

   capital_gain  capital_loss  hours_per_week  native_country  income
0          2174             0              40   United-States   <=50K
1             0             0              13   United-States   <=50K
2             0             0              40   United-States   <=50K
3             0             0              40   United-States   <=50K
4             0             0              40            Cuba   <=50K

In [87]:
'''2. Write two basic update queries'''

#Update Query 1
cursor.execute('UPDATE sqladb SET fnlwgt = "284786" WHERE fnlwgt = " 234721"')
print(pd.read_sql_query('SELECT * from sqladb where fnlwgt = "284786"', connection))

   index  age workclass  fnlwgt education  education_num       marital_status  \
0      3   53   Private  284786      11th              7   Married-civ-spouse

           occupation relationship    race    sex  capital_gain  capital_loss  \
0   Handlers-cleaners      Husband   Black   Male             0             0

   hours_per_week  native_country  income
0              40   United-States   <=50K

In [33]:
#Update Query 2
cursor.execute('UPDATE sqladb SET workclass = "Private Sector" WHERE workclass = " Private"')
print(pd.read_sql_query("SELECT * FROM sqladb", connection))

   index  age workclass  fnlwgt education  education_num       marital_status  \
0      3   53   Private  284786      11th              7   Married-civ-spouse

           occupation relationship    race    sex  capital_gain  capital_loss  \
0   Handlers-cleaners      Husband   Black   Male             0             0

   hours_per_week  native_country  income
0              40   United-States   <=50K

In [34]:
'''3. Write two delete queries'''

# Delete Query 1
cursor.execute('DELETE FROM sqladb WHERE fnlwgt = " 234721"')
print(pd.read_sql_query('SELECT * FROM sqladb where fnlwgt = "234721"', connection).head(5))

       index  age       workclass  fnlwgt    education  education_num  \
32556  32556   27  Private Sector  257302   Assoc-acdm             12
32557  32557   40  Private Sector  154374      HS-grad              9
32558  32558   58  Private Sector  151910      HS-grad              9
32559  32559   22  Private Sector  201490      HS-grad              9
32560  32560   52    Self-emp-inc  287927      HS-grad              9

            marital_status          occupation relationship    race      sex  \
32556   Married-civ-spouse        Tech-support         Wife   White   Female
32557   Married-civ-spouse   Machine-op-inspct      Husband   White     Male
32558              Widowed        Adm-clerical    Unmarried   White   Female
32559        Never-married        Adm-clerical    Own-child   White     Male
32560   Married-civ-spouse     Exec-managerial         Wife   White   Female

       capital_gain  capital_loss  hours_per_week  native_country  income
32556             0             0              38   United-States   <=50K
32557             0             0              40   United-States    >50K
32558             0             0              40   United-States   <=50K
32559             0             0              20   United-States   <=50K
32560         15024             0              40   United-States    >50K

In [88]:
#Delete Query 2
cursor.execute('DELETE FROM sqladb WHERE age = " 38" AND fnlwgt = "215646"')
print(pd.read_sql_query('SELECT * FROM sqladb WHERE age = " 38" AND fnlwgt = "215646"', connection).head(5))

Empty DataFrame
Columns: [index, age, workclass, fnlwgt, education, education_num, marital_status, occupation, relationship, race, sex, capital_gain, capital_loss, hours_per_week, native_country, income]
Index: []

In [89]:
'''4. Write two filter queries'''

#Filter Query 1
cursor.execute('SELECT DISTINCT * FROM sqladb WHERE education = " Bachelors" AND age < 25 AND relationship = " Unmarried" AND sex = " Female" and native_country=" United-States"')
output = cursor.fetchall()
print(output)

[(12966, 23, ' Private', 526164, ' Bachelors', 13, ' Never-married', ' Adm-clerical', ' Unmarried', ' Black', ' Female', 0, 0, 40, ' United-States', ' <=50K'), (16658, 22, ' Private', 203182, ' Bachelors', 13, ' Never-married', ' Exec-managerial', ' Unmarried', ' White', ' Female', 0, 0, 30, ' United-States', ' <=50K'), (20336, 24, ' Private', 187937, ' Bachelors', 13, ' Never-married', ' Prof-specialty', ' Unmarried', ' White', ' Female', 0, 0, 40, ' United-States', ' <=50K'), (31479, 24, ' Private', 498349, ' Bachelors', 13, ' Never-married', ' Transport-moving', ' Unmarried', ' Black', ' Female', 0, 0, 40, ' United-States', ' <=50K')]

In [90]:
#Filter Query 2

cursor.execute('SELECT DISTINCT * FROM sqladb WHERE education = " Bachelors" and age < 25 and income <= "50k" and native_country=" India"')
output = cursor.fetchall()
print(output)

[(1095, 22, ' Self-emp-not-inc', 361280, ' Bachelors', 13, ' Never-married', ' Prof-specialty', ' Own-child', ' Asian-Pac-Islander', ' Male', 0, 0, 20, ' India', ' <=50K')]

In [91]:
'''5. Write two function queries'''
#Function Query 1

def new_entry(db_file, new_data):
    
    query = "INSERT INTO sqladb VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?);"

    cursor.execute(query, list(new_data))

new_entry('sqladb',('32660', '30','Private', '7861369', 'Masters', '9', 'Married', 'Front_End', 'In_Family', 'Indian', 'Male', '0', '0', '40', 'United-States', '>=50K'))
print(pd.read_sql_query('SELECT * from sqladb where fnlwgt ="7861369"',connection))

   index  age workclass   fnlwgt education  education_num marital_status  \
0  32660   30   Private  7861369   Masters              9        Married

  occupation relationship    race   sex  capital_gain  capital_loss  \
0  Front_End    In_Family  Indian  Male             0             0

   hours_per_week native_country income
0              40  United-States  >=50K

In [92]:
#Function Query 2
def age_check():
    cursor.execute('SELECT avg(age) FROM sqladb WHERE education=" Masters" AND sex=" Male"')
    output = cursor.fetchall()
    print(output)    

    
age_check()

[(44.490311710193765,)]

In [93]:
 connection.close()